Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: All platforms that enable UEFI secure boot should ship in setup mode where the owner has control over which platform key (PK) is installed.
ja: UEFI secure boot が有効なすべてのプラットフォームは setup モードで出荷し、オーナーがどのプラットフォーム鍵 (PK) をインストールするか制御できるようにする。

source: FOSSology is an open source project and participation is open to anyone through http://fossology.org/.
ja: FOSSology はオープン ソース プロジェクトですので、http://fossology.org/ サイトから、誰でも参加できます。

source: Gain insight into industry best practices in organizing and managing the compliance function in this condensed version of compliance training delivered live via the internet.
ja: インターネット経由で配信されるこの要約版コンプライアンス トレーニングで、コンプライアンスの体制化や管理における業界のベスト プラクティスを見ることができます。

source: - Contacts in the FOSS community and in the FOSS organizations that could be called upon for clarification
ja: 確証を得るために必要な FOSS コミュニティおよび FOSS 組織における人脈

source: Job descriptions identify the skills and insights needed to perform compliance functions adequately.
ja: 職務説明書により、コンプライアンスを適正に履行するために必要なスキルと見識を特定する。

source: Performing a pre-distribution verification of all previous steps
ja: 以上のすべての処理を配布前に検証する

source: 08:00 GMT: QA Report
ja: 08:00 (世界標準時): ウィークリー リリース

source: It also receives built packages back from the workers and maintains the build history.
ja: また、ビルドされたパッケージをワーカーから受け取り、ビルド履歴を保持します。

source: Offer training to bring awareness to compliance issues and to the different types and categories of FOSS licenses and the implications of including FOSS source code in proprietary or 3rd party source code without proper approval.
ja: トレーニングにより、コンプライアンス問題や FOSS のさまざまなライセンスを認識させる。また適切な承認なしにプロプライエタリ ソース コードやサード パーティのソース コードに FOSS ソース コードを含めるとどうなるかを認識させる。

source: The scheme above covers first boot for the case where the platform ships in setup mode.
ja: 前述の方法は、setup モードでプラットフォームが出荷された場合の最初のブートに関するものです。

source: Feedback provided to the Linux Foundation will not be attributed to the provider to encourage organizations to share their thoughts on compliance and on the uses they are making of the checklist.
ja: Linux Foundation に提出されたフィードバックは、組織間でコンプライアンスに関する意見やチェックリストの利用に関する意見を共有する際に、共通の資料として役立てられます。◆不明◆◆◆

source: Companies can take several steps to ensure the institutionalization of compliance within the company's development culture and to ensure its sustainability.
ja: 企業は段階的に、自社の開発文化の中でコンプライアンスを確実に制度化し、その持続可用性を保証することができます。

source: Processes and policies are important, however, they have to be light and efficient so that the engineering teams do not regard them as overly burdensome to the development process.
ja: プロセスとポリシーは重要ですが、エンジニアリング チームが、それほど開発プロセスの負担にならないと認める程度に軽くて効率的でなくてはなりません。

source: This leads to the obvious shortcoming that, for a desktop system loaded with multiple third-party cards, the EFI drivers for each of the cards must have its own KEK in the signature database.
ja: これにより、明らかな欠点が生まれます。すなわち、複数のサード パーティのカードを搭載しているデスクトップ システムの場合、各カードの EFI ドライバーが、署名データベースにそれぞれ専用の鍵交換鍵を置かなければならない、ということです。

source: Check Out Embedded Linux Projects
ja: 組込み Linux プロジェクトをチェックする

source: Database
ja: データベース

source: The compliance team verifies that copyright notices, attribution notices, license text, and any modification logs have been included accurately.
ja: コンプライアンス チームは、著作権告知、帰属告知、ライセンス文書、およびすべての変更記録が正確に含まれていることを検証する。

source: While most companies want to do the right thing with regard to license compliance when re-using code components, the lack of a clear set of software package data exchange(TM) standards complicates matters.
ja: 多くの企業は、コード コンポーネントを再利用する際、ライセンス コンプライアンスに関して正しい行動をとろうとしますが、明確な ソフトウェア パッケージ データ交換 (SPDX: software package data exchange(TM)) の標準規格がないため、問題が複雑化しています。

source: Day
ja: 日

source: Furthermore, the training provides a demonstration of how to fill out the OSRB form and provide information about available FOSS guidelines.
ja: また、OSRB 申請書の書き方、利用可能な FOSS ガイドラインの情報などを教えます。

source: The Linux Foundation has compiled an extensive checklist of compliance practices found in industry-leading compliance programs.
ja: The Linux Foundation は、業界に先駆けて提供するコンプライアンス プログラムの一環として、この広範なコンプライアンス プラクティス チェックリストを編成しました。

source: Collaboration Platform
ja: コラボレーション プラットフォーム

source: Establishing a clean software baseline for version 1.0 products
ja: バージョン 1.0 製品 (=最初) のクリーンなソフトウェア ベースラインを確立する

source: A Compliance Directory and Rapid Alert System
ja: コンプライアンス ディレクトリと緊急警報システム

source: b)Appropriate resources are available for the interpretation of OSS licenses and definition of obligations to be satisfied.
ja: b) OSS ライセンスの解釈や、履行するべき義務の定義について、適切なリソースを利用することができる。

source: Figure 4 illustrates a sample process a compliance inquiry might go through.
ja: 図 4 は、コンプライアンスの照会を受けてから解決するまでの手順を表したものです。

source: The initial bootstrap of an operating system should detect a platform in the setup mode, install its own key-exchange key (KEK), and install a platform key to enable secure boot.
ja: 最初の OS ブートストラップでは、setup モードでプラットフォームを検出し、各自の鍵交換鍵 (key-exchange key: KEK) をインストールし、さらにプラットフォーム鍵をインストールして、secure boot を有効にする。

source: Estimates of product-related compliance activities are estimated and tracked from the perspective of both the organizational compliance team and the product team.
ja: 組織のコンプライアンス チームと製品担当チームの両方の観点から、製品関連のコンプライアンス作業の見積もりを算定し、追跡する。

source: All FOSSology users who wish to create a scanned library of open source code must create their own.
ja: オープン ソース コードのスキャン済みライブラリを作成したい FOSSology ユーザーは、みな各自でそれを作成しなければならない。

source: Packager
ja: パッケージャー

source: Package Name
ja: パッケージ名

source: Some companies use their bug tracking tools that are already in place with a customized compliance workflow; other companies rely on specific project management tools or even in-house solutions.
ja: 既に独自のバグ追跡ツールやカスタマイズされたコンプライアンス ワークフローを使用している企業もありますが、その他の企業は、特定のプロジェクト管理ツールや、社内ソリューションに依存しています。

source: However, unlike the core team, members of the extended team are only working on compliance on an as-needed basis, based on tasks they receive from the core team or the OSRB.
ja: ただしコア チームとは異なり、拡張チームのメンバーは、OSRB からの要請を受けて、必要に応じてコンプライアンスに取り組みます。

source: Tools are an essential building block in a compliance program that can assist companies with their compliance activities as efficiently and accurately as possible.
ja: ツールは、コンプライアンス プログラムに不可欠な要素で、企業のコンプライアンス業務をできるかぎり効率的かつ的確に支援することができます。◆

source: OSRB Participants
ja: OSRB の参加者

source: Discovery concerns itself with identifying the third party licensed software, including open source software, in a product readied for release.
ja: 「検出」は、出荷予定の製品に含まれているサードパーティ ライセンス ソフトウェア (オープン ソース ソフトウェアを含む) の識別に関わるプロセスです。

source: Simple view of the compliance end-to-end process
ja: オープン ソース コンプライアンス プロセスの概要図

source: Location
ja: 会場

source: October 2011
ja: 2011 年 10 月

source: An Introduction into Open Build Service (OBS)
ja: Open Build Service (OBS) 入門

source: October 2010
ja: 2010 年 10 月

source: Institutionalizing and sustaining compliance efforts
ja: コンプライアンスの取り組みを制度化し持続する

source: Education
ja: 教育

source: In most companies, the Compliance Officer is called Director of Open Source, Director of Open Source Program Office, Director of Open Source Management or variation of these titles.
ja: 多くの企業では、コンプライアンス オフィサーをオープン ソース ディレクター、オープン ソース プログラム オフィス ディレクター、オープン ソース管理ディレクターなどと呼んでいます。

source: Figure 1 offers a high-level overview of a sample end-to-end compliance process and illustrates the various compliance steps or phases that components containing free and open source software go through before they get approved for use in a product intended for external distribution (Other ways of organizing the compliance process may well accomplish the same goals of achieving compliance.)
ja: 図 1 は、コンプライアンス プロセスの一例の概要図です。FOSS を含むコンポーネントが、外部に配布する製品への使用承認を受ける前に通過するコンプライアンス ステップとフェーズを表しています (これとは異なったコンプライアンス プロセスの編成方法でも、同じようにコンプライアンスを履行することは可能です)。

source: Learn more about the Self-Assessment Checklist.
ja: 自己診断チェックリストの詳細

source: - Component has been registered in the software inventory
ja: コンポーネントがソフトウェア インベントリに登録されている

source: Initially, we expect the group to roll up the sleeves on this live testing, but will work hard to get others in the community involved as well.
ja: まずは、当グループが、このライブ テストを始めますが、私たちは、グループ以外の人々にも関わってもらうよう働きかけます。

source: There is one source server per OBS managing the sources, revisions, project/package metadata, package search, etc.
ja: ソース、リビジョン、プロジェクト/パッケージ メタデータ、パッケージ サーチなどを管理する OBS ごとに 1 つのソース サーバーがあります。

source: She has a BS in Computer Science from University of Manitoba, and a MM in Computer Science from University of Waterloo.
ja: 彼女は、カナダのマニトバ大学でコンピューター サイエンスの BS を、ウォータールー大学でコンピューターサイエンスの MM を取得しています。

source: Company to provide additional notices in product publications
ja: 企業は、製品の配布時にその他の告知を行う

source: To learn more about The Linux Foundation, the Open Compliance Program or our other initiatives please visit us at http://www.linuxfoundation.org/.
ja: The Linux Foundation、オープン コンプライアンス プログラムおよびその他の活動については、http://www.linuxfoundation.org/ を参照してください。

source: That is typical for Linux where the toolchain used to build the system is considered part of the build dependencies.
ja: これは Linux に特有のもので、システムの構築に使用されるツールチェーンは、ビルドの依存関係の一部とみなされます。

source: The Open Compliance Program offers comprehensive training and informational materials, open source tools, an online community (FOSSBazaar), a best practices checklist, a rapid alert directory of company’s compliance officers and a standard to help companies uniformly tag and report software used in their products.
ja: （）オープン コンプライアンス プログラムは、包括的なトレーニングや情報資料、オープン ソース ツール、オンライン コミュニティ (FOSSBazaar)、ベストプラクティス チェックリスト、企業のコンプライアンス オフィサーの緊急警報ディレクトリ、製品で使用しているソフトウェアを一様に認識およびレポートするための標準 (SPDX) などを提供します。

source: This method ensures that compliance is part of the software development process and not an activity that is either an overhead to development, or an activity that is trying to catch up with development (in terms of speed and coverage).
ja: この方法により、コンプライアンスは確実にソフトウェア開発プロセスの一部になり、スピードの面でも適用範囲の面でも、開発に負担をかける活動や、開発の後を追いかけるような活動に陥ることはありません。

source: The providers of each software component are known
ja: 各ソフトウェア コンポーネントの提供者がわかっている

source: References
ja: 参考

source: - Assign and track tasks
ja: タスクの割り当てと追跡を行う

source: a)The designated compliance officer has access to the organization's senior executives to escalate compliance issues whenever needed.
ja: a) 指定されたコンプライアンス オフィサーは、組織の役員レベルの管理層に対し、コンプライアンス問題を随時報告できること。

source: On December 18, 2007, HP released FOSSology as an open source project under the GPL v2 license to contribute to the open source community by providing software that could be used by upstream projects and distributions to ensure licensing issues are addressed as early as possible, and to all corporations using open source software in their products by simplifying their license compliance efforts.
ja: 12 月 18 日、HP 社は、FOSSology を GPL v2 ライセンスの下でオープン ソース プロジェクトとしてリリースしました。その目的は、アップストリーム プロジェクトやディストリビューションが、ライセンス問題を早期解決するために利用可能なソフトウェアをオープン ソース コミュニティに提供すること、および、自社製品にオープン ソース ソフトウェアを使用するすべての企業のライセンス コンプライアンス業務を簡略化することです。

source: Companies are also recommended to create a list of conditions that define when a new scan is required to make the process more efficient.
ja: また、スキャン処理が必要なタイミングの条件をリストにすることで、プロセスをさらに効率化することもできます。

source: specification is a standard format for communicating the components, licenses and copyrights associated with a software package.
ja: 仕様とは、ソフトウェア パッケージに関連するコンポーネント、ライセンス、および著作権情報をやり取りするための標準フォーマットです。

source: Local builds use the exact same build environment and toolchain as the build service.
ja: ローカル ビルドは、ビルド サービスと全く同じビルド環境とツールチェーンを使用します。

source: Early submission and review of OSRB usage form
ja: OSRB 使用申請書の迅速な提出とレビュー

source: Therefore, it is an expectation that these companies honor the licenses of the FOSS components included in their products.
ja: つまりそれらの企業が、製品に含まれる FOSS コンポーネントのライセンス条件を尊重することを期待しています。

source: Training also serves as a venue to publicize and promote the compliance policy and processes within the organization and to promote a culture of compliance.
ja: またトレーニングは、組織内でコンプライアンスのポリシーやプロセスを公表および推進し、コンプライアンスの文化普及を促進する場でもあります。

source: Server
ja: サーバー

source: are defined and documented.
ja: が定義され、文書化されている。

source: However, source control systems for development can easily be integrated with the OBS workflow.
ja: ただし、開発用のソース制御システムを OBS に簡単に統合することができます。

source: And software development organizations care - especially distributed global development teams who collaborate and need visibility into licenses and their obligations.
ja: また、ソフトウェアを開発している組織、特に、グローバルに分散している開発チームが協力し合い、ライセンスや義務の視認性を必要としているような組織も関心を持っています。

source: This is something that will be addressed in a future release.
ja: これは今後のリリースで改善されるでしょう。

source: Just the facts, please
ja: 事実だけが必要

source: Introduction to OBS
ja: OBS とは

source: Linux is making its way very deeply into embedded devices, from consumer electronics to embedded devices to in-vehicle infotainment.
ja: Linux は、コンシューマー エレクトロニクスから車載情報機器に至るまで、組込み機器に深く浸透しています。

source: In some cases, the compliance due diligence may result a decision not to proceed with the transaction given that the compliance situation is far from ideal.
ja: コンプライアンス精査によって、コンプライアンスの状況が理想に程遠いものであることがわかれば、取引中止の決断が下される場合もあります。

source: Illustration of a compliance end-to-end management process
ja: コンプライアンス管理プロセスの詳細

source: The Backend
ja: バックエンド

source: Engineering and product teams may have one or more representatives that participate in the OSRB and track down all compliance related tasks (sometimes called tickets) assigned to engineering.
ja: エンジニアリング チームやプロダクト チームでは、OSRB に １ 人以上の代表者が参加し、エンジニアリングに割り当てられたすべてのコンプライアンス関連作業 (チケットと呼ばれることもある) を追求します。

source: Compliance Process Management
ja: コンプライアンス プロセス管理

source: - Contribute to the creation of new tools to facilitate the automation and discovery of FOSS in the development environment
ja: 開発環境における自動化と FOSS 検出を促進する新ツールの開発に貢献する

source: The Linux Foundation is compiling an extensive checklist of practices found in industry-leading compliance programs.
ja: The Linux Foundation は、業界の優れた各種コンプライアンス プログラムを分析し、この詳細なコンプライアンス プラクティス チェックリストを編成しました。

source: Chumby is a fun little (extremely hackable) device that runs its own Linux distribution.
ja: Chumby は、独自の Linux ディストリビューションを実行する少々おもしろい (とても改造しやすい) デバイスです。

source: Audience and Intended Purpose
ja: 利用者、および、意図された目的

source: The Repository Server
ja: リポジトリ サーバー

source: How do you join the fun?
ja: このような組込み Linux の動きに参加するにはどうすればよいでしょう。

source: Organizing and managing the compliance function
ja: コンプライアンス機能チームの編成と管理

source: Linux and other open operating systems will be able to take advantage of secure boot if it is implemented properly in the hardware.
ja: secure boot をハードウェアに正しく実装できれば、Linux などのオープン OS も、これを有効に利用することができます。

source: There are four recommended practices in relation to source code auditing or scanning:
ja: ソース コードの監査やスキャンに関する推奨プラクティスは、4 つあります。

source: a)Corrective actions are taken to address process inadequacies.
ja: プロセスの不備に対処するための是正措置が取られる。

source: The Warden Process
ja: ウォードン (Warden) プロセス

source: This software package is licensed under the GPL version 2.
ja: このソフトウェア パッケージは、GPL version 2 の下でライセンスされています。

source: So if someone were to clone a file and strip out the original license, the license scanner would not detect the clone.
ja: このため、もし誰かがあるファイルのクローンを作成し、オリジナルのライセンスを削除しても、ライセンス スキャナーは、そのクローンを検出できない。

source: The organization systematically achieves closure on issues arising from discovery activity.
ja: 組織は、検出活動によって生じる問題を体系的に解決する。

source: Even in the open model, where the platform owner controls the PK, it becomes burdensome to verify and allow a new KEK every time a single PCI card is added or changed.
ja: オープン モデルでは、プラットフォーム オーナーがプラットフォーム鍵を管理しているため、PCI カードが追加されたり、変更されたりするたびに、新しい鍵交換鍵を認証して有効にする、という煩わしい処理が生じます。

source: Compliance training requirementand how to tailor the content
ja: コンプライアンス トレーニングの要件、および内容の調整

source: Proprietary software, created by their own developers which may include snippets of FOSS or in many cases depends on or links to FOSS.
ja: 1 つ目はプロプライエタリ ソフトウェアです。これは、自社の開発者によって作成されたもので、FOSS の断片が含まれている場合があります。また、多くの場合、FOSS に依存あるいはリンクしています。

source: Quality Control
ja: 品質管理

source: A software package’s declared license may not always match the licenses of individual files inside the package.
ja: ソフトウェア パッケージで宣言されているライセンスは、パッケージ内の個々のファイルのライセンスと常に一致するわけではない。

source: d)An ombudsman is established so that individual employees have a channel of communication to voice their concerns or questions.
ja: d) 各従業員が意見や質問を発するコミュニケーション手段を持てるように、オンブズマンを設置している。

source: Discovery of open source inclusion
ja: 組み込まれているオープン ソースの検出

source: The management team endorses the policy and assures that all employees involved with open source understand and follow the policy.
ja: 管理チームは、ポリシーを支持し、オープン ソースに関わるすべての従業員に、そのポリシーを確実に理解させること。

source: License names
ja: ライセンス名

source: There are no contracts signed with the software providers (i.e., FOSS developers).
ja: ソフトウェアの提供者 (FOSS の開発者など) が署名した契約書は存在しません。

source: The license, copyright and attribution notices for that specific component are prepared and passed along to the appropriate departments to be included in the product documentation.
ja: 対象のコンポーネントのライセンス、著作権情報、および帰属告知が準備され、製品の付随資料に含めるべく担当部署に手渡される。

source: A determination is made whether an employee's proposed contribution is work-related or non-work-related based upon an existing guideline.
ja: 確立されたガイドラインに基づいて、従業員による貢献が業務上のものか、あるいは非業務上のものかを見極めること。

source: To add contact information for compliance purposes or query the directory:http://www.linuxfoundation.org/programs/legal/compliance/directory/
ja: コンプライアンスを目的とする連絡先情報の追加、または連絡簿の照会については、下記を参照してください。 http://www.linuxfoundation.org/programs/legal/compliance/directory/

source: Source code scanning and license identification tool
ja: ソース コード スキャン/ライセンス識別ツール (Source code scanning and License identification Tool)

source: Inquiry Response Strategy
ja: 照会対応戦略

source: Conduct Design Reviews
ja: 設計レビューを指揮する

source: - FOSS added to the code repository and does not correspond to a usage form
ja: FOSS の使用申請書に対応していない FOSS がコード リポジトリに追加された

source: Title
ja: タイトル

source: - Receiving approval to use FOSS
ja: FOSS 使用の承認を受ける

source: a)A compliance fulfillment process exists for satisfying routine requests.
ja: a) 定型のリクエストに対応するためのコンプライアンス履行プロセスが存在する。

source: Community and public resources
ja: コミュニティのリソースやパブリックなリソース

source: Enables companies to standardize their bills of material to ease the discovery and labeling of open source components in their products; this is especially important for consumer electronics manufacturers who assemble parts from a variety of suppliers into their shipping products.
ja: 企業は、BoM (構成表) を標準化することにより、自社製品に含まれている OSS コンポーネントを簡単に発見し、ラベル付けすることができます。これは、情報家電産業のようにさまざまなサプライヤーから部品を入手し、組み立てて最終製品化する企業にとっては特に重要になります。

source: Half-day, one-day and two-day versions of the courses will be offered for a fee on-site at company facilities to communicate compliance requirements, essential practices, and ways to handle compliance challenges.
ja: 半日、1 日、2 日間バージョンの有料オンサイト コースがあり、コンプライアンス要件、基本プラクティス、コンプライアンス課題の処理方法などについて学ぶことができます。

source: Declared license(s) governing file (from file)
ja: 各ファイルに適用されるライセンス (ファイルから抽出)

source: Primary Responsibilities
ja: 主な責任

source: The checklist will be available for download from the Linux Foundation web site on 11/01/2010.
ja: このチェックリストは、2010 年 11 月 1 日より The Linux Foundation の Web サイトにて公開されています。

source: Resolving issues as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「問題解決」ステップ

source: openSUSE releases of packages and entire distributions are transparently built in the openSUSE Factory Project which includes automatic image creation.
ja: openSUSE のパッケージ リリースおよびディストリビューション全体は、openSUSE Factory プロジェクトで透過的にビルドされ、イメージ自動生成まで行われます。

source: The Open Compliance Program presents a wide-ranging array of tools, training, and informative guidance to help companies comply with open source license obligations, with the goal of increasing adoption of open source and decreasing FUD present in the marketplace.
ja: オープン コンプライアンス プログラムは、オープン ソースの導入を推進すること、および市場に存在する不安や懸念を取り除くことを目標に、企業によるオープン ソース ライセンス義務履行を助けるさまざまなツール、トレーニング、情報ガイダンスなどを提供するものです。

source: The SPDX(TM) Working Group does not attempt to apply legal judgment, for example, by classifying a license as “BSD-like.”
ja: SPDX(TM) ワーキング グループは、個々のライセンスを、たとえば「BSD ライクな」ライセンスなどと分類することによって、法的判断を適用しようというわけではありません。

source: - Participate in engineering reviews, code inspections, distribution readiness assessment
ja: エンジニアリング レビュー、コード検査、配布準備査定に参加する

source: To solve this problem, UEFI allows (in section 27.6.1) X509 certificates to be present in the signature database.
ja: この問題を解決するために、UEFI は、セクション 27.6.1 において、署名データベースに X509 証明書を置くことを許可しています。

source: To learn more, request more information, or to register for open compliance training, please visit
ja: 詳細情報について、およびオープン コンプライアンス トレーニングの登録については、下記のページを参照してください。

source: An overview of the compliance program suitable for executive management is included, as well as discussion of the compliance contributions needed from various functional groups such as the Law Department, Supply Chain, Technical Documentation, and Configuration Management.
ja: エグゼクティブ レベルの管理者層向けのコンプライアンス プログラムの概要のほか、法務部門、サプライ チェーン部門、技術文書化部門、構成管理部門などの各種職能グループに必要なコンプライアンスの説明も含まれています。

source: Compliance practices included in the checklist will improve the effectiveness of compliance programs as well as deliver tangible benefit relative to the cost of those practices.
ja: チェックリストに含まれているコンプライアンス プラクティスは、コンプライアンス プログラムの効率性を高め、プラクティスにかかるコストよりはるかに有益なメリットをもたらします。

source: Compliance Inquiries
ja: コンプライアンスの照会

source: All facets of the companies are typically involved in ensuring proper compliance and contributing to the end-to- end management of FOSS.
ja: 企業は一体となって、適切なコンプライアンスを確保し、FOSS の徹底管理に努めることが必要です。

source: c)Compliance effort is estimated.
ja: c) コンプライアンス活動の見積もりが行われている。

source: In addition, organizing, managing and staffing for the compliance effort will also be discussed.
ja: また、コンプライアンス活動を行うための組織作り、管理、人材登用について取り上げます。

source: Reporting ?
ja: 報告

source: The Free Software Foundation (FSF) does not provide or approve any translations of the GNU GPL, LGPL, AGPL, and FDL into other languages.
ja: The Free Software Foundation (FSF) では、GNU GPL、LGPL、AGPL、および FDL の他言語への翻訳を提供も承認もしていません。

source: We will be discussing these tools in a future paper.
ja: これらのツールについては、今後公開するホワイトペーパーで説明する予定です。

source: The Code Janitor tool was initiated by the Linux Foundation as an Open Source project and it allows its users to create a database of inappropriate words (or keywords) the tool will use in a brute force scan of the code.
ja: コード管理ツールは、The Linux Foundation がオープン ソース プロジェクトとして手がけたもので、ユーザーが不適切な文言やキーワードのデータベースを作成しておき、ツールはそのデータベースを使用して、コードのブルート フォース スキャン (総当たりスキャン) を行います。

source: Ensure availability of a dedicated compliance core team that consists of the Compliance Officer, Legal Counsel and Engineering representatives (we will discuss roles and responsibilities in a future paper)
ja: コンプライアンス オフィサー、リーガル カウンセラー、およびエンジニアリング部門代表者からなる専任のコンプライアンス コア チームの可用性を確認する (役割と責任については、今後公開予定のホワイトペーパーで説明)

source: Collect the applicable FOSS licenses for review by the legal department
ja: 法務部門のレビューに備え、適用される FOSS のライセンスを収集する

source: Once the auditing is complete and all issues identified earlier have been resolved, the compliance ticket for a specific software component moves to the review step (Figure 6).
ja: 監査が終わり、先に検出されたすべての問題が解決されると、対象となるソフトウェア コンポーネントのコンプライアンス チケットは、調査ステップに移動します (図 6)。

source: FOSS, developed by the FOSS community and received by the company building the product under a FOSS license
ja: FOSS: FOSS コミュニティが開発し、その製品の製造元が FOSS のライセンスの下で入手したコード
